# PANDAS

# Series

In [8]:
import pandas as pd
x = [1,2,3,4,5]
v=pd.Series(x)
print(v)
print(type(v))
print(v[2])     # to get values by index number

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
3

In [10]:
x = [1,2,3,4,5]
v=pd.Series(x,index=['a','b','c','d','e'])     # TO SET INDEX VALUES
print(v)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
data={
    "name":["john","alice","bob","emma","liam"],
    "age": [18,19,17,20,18],
    "marks":[85,92,78,65,88]
}
gh=pd.DataFrame(data)
print(gh)

    name  age  marks
0   john   18     85
1  alice   19     92
2    bob   17     78
3   emma   20     65
4   liam   18     88

In [13]:
v1=pd.Series(14,index=[1,2,3,4,5,6,7])
v2=pd.Series(14,index=[1,2,3,4])
print(v1+v2)

1    28.0
2    28.0
3    28.0
4    28.0
5     NaN
6     NaN
7     NaN
dtype: float64

# DATAFRAMES

In [24]:
import pandas as pd

l=[1,2,3,4,5,6,7]
var= pd.DataFrame(l)
print(type(var))

<class 'pandas.core.frame.DataFrame'>

In [25]:
l=[1,2,3,4,5,6],[5,4,2,7,1,5]
v=pd.DataFrame(l)
print(type(v))
print(v)

<class 'pandas.core.frame.DataFrame'>
   0  1  2  3  4  5
0  1  2  3  4  5  6
1  5  4  2  7  1  5

# ARITHMATIC OPERATIONS

In [4]:
import pandas as pd
v=pd.DataFrame({"A":[1,2,3,4,5],"B":[5,6,7,8,5]})
v

   A  B
0  1  5
1  2  6
2  3  7
3  4  8
4  5  5

In [31]:
v["c"]=v["A"]+v["B"]
v

   A  B   c
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12
4  5  5  10

In [32]:
v["c"]=v["A"]-v["B"]
v

   A  B  c
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4
4  5  5  0

In [33]:
v["c"]=v["A"]*v["B"]
v

   A  B   c
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32
4  5  5  25

In [34]:
v["c"]=v["A"]/v["B"]
v

   A  B         c
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000
4  5  5  1.000000

In [36]:
v=pd.DataFrame({"A":[10,20,30,40,50],"B":[50,60,70,80,90]})
v

    A   B
0  10  50
1  20  60
2  30  70
3  40  80
4  50  90

In [8]:
v["pyhton"]=v["A"] <= 20
v["java"]=v["B"] >= 18
v                                 # TO CREATE NEW COLUMN AND COMPARE NUMBER

   A  B  pyhton   java
0  1  5    True  False
1  2  6    True  False
2  3  7    True  False
3  4  8    True  False
4  5  5    True  False

# DELETE AND INSERT DATA IN PANDAS

In [10]:
import pandas as pd
v  = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
v

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [11]:
v.insert( 1,"python",v["A"])
v

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5

In [13]:
v.insert( 1,"python_1",[11,12,13,14,15])
v

   A  python_1  python  B
0  1        11       1  9
1  2        12       2  8
2  3        13       3  7
3  4        14       4  6
4  5        15       5  5

In [14]:
import pandas as pd
v  = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
v

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [16]:
v["python_12"] = v["A"][:3]
v

   A  B  python_12
0  1  9        1.0
1  2  8        2.0
2  3  7        3.0
3  4  6        NaN
4  5  5        NaN

# DELETE

In [22]:
import pandas as pd
v  = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[11,12,13,14,15]})
v

   A  B   C
0  1  9  11
1  2  8  12
2  3  7  13
3  4  6  14
4  5  5  15

In [24]:
v1= v.pop("B")
v1                   #DELETE COLUMN

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

In [25]:
v

   A   C
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [26]:
del v["A"]
v

    C
0  11
1  12
2  13
3  14
4  15

# HOW TO CREATE CSV FILE

#  CSV - csv format is a plain text format in which values are seprated by commas(Comma Seprated Values)

#  XLS - file format is an excel sheets binary file format which holds information about all the worksheets in a file

# WRITE CSV

In [4]:
import pandas as pd

dis = {"a": [1,2,3,4,5,6],"s": [1,2,3,4,5,6],"d": [1,2,3,4,5,6]}

d=pd.DataFrame(dis)

print(d)

d. to_csv("Test_new.csv")

   a  s  d
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5  6  6  6

In [6]:
#import pandas as pd

dis = {"a": [1,2,3,4,5,6],"s": [1,2,3,4,5,6],"d": [1,2,3,4,5,6]}

d=pd.DataFrame(dis)

print(d)

#d. to_csv("Test_new.csv",index=False,header=[1,2,3])  # TO REMOVE INDEX AND HEADER FROM DATASET

   a  s  d
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5  6  6  6

# READ CSV

In [13]:
import pandas as pd
csv_1 = pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv")     # (FILE.....copy as path)
csv_1
csv_1.head()                                                      # TOP 5 ROWS

  Student_ID          Name  Age        Department
0       S001    John Smith   20  Computer Science
1       S002  Emma Johnson   19       Mathematics
2       S003  Michael Chen   21           Physics
3       S004  Sophia Patel   20         Chemistry
4       S005     James Lee   22           Biology

In [18]:
csv_1 = pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv", dtype={"Age":"float"})
csv_1
csv_1.head()                                          # TO CONVERT COLUMN IN FLOAT

  Student_ID          Name   Age        Department
0       S001    John Smith  20.0  Computer Science
1       S002  Emma Johnson  19.0       Mathematics
2       S003  Michael Chen  21.0           Physics
3       S004  Sophia Patel  20.0         Chemistry
4       S005     James Lee  22.0           Biology

# PANDAS FUNCTION

In [2]:
import pandas as pd
csv_1=pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv")
csv_1.head()

  Student_ID          Name  Age        Department
0       S001    John Smith   20  Computer Science
1       S002  Emma Johnson   19       Mathematics
2       S003  Michael Chen   21           Physics
3       S004  Sophia Patel   20         Chemistry
4       S005     James Lee   22           Biology

In [20]:
csv_1.index

RangeIndex(start=0, stop=50, step=1)

In [23]:
csv_1.columns

Index(['Student_ID', 'Name', 'Age', 'Department'], dtype='object')

In [26]:
csv_1.describe()    # to get (mean, std, count......)..use this function

             Age
count  50.000000
mean   20.380000
std     1.047641
min    19.000000
25%    20.000000
50%    20.000000
75%    21.000000
max    22.000000

In [28]:
csv_1.tail()

   Student_ID             Name  Age        Department
45       S046    Joshua Morgan   20  Computer Science
46       S047       Emily Bell   21       Mathematics
47       S048    Andrew Murphy   20           Physics
48       S049  Samantha Rivera   22         Chemistry
49       S050     Dylan Cooper   19           Biology

In [31]:
csv_1.tail(2)

   Student_ID             Name  Age Department
48       S049  Samantha Rivera   22  Chemistry
49       S050     Dylan Cooper   19    Biology

In [32]:
csv_1.head(2)

  Student_ID          Name  Age        Department
0       S001    John Smith   20  Computer Science
1       S002  Emma Johnson   19       Mathematics

In [33]:
csv_1[:2]

  Student_ID          Name  Age        Department
0       S001    John Smith   20  Computer Science
1       S002  Emma Johnson   19       Mathematics

In [34]:
csv_1[6:11]

   Student_ID            Name  Age        Department
6        S007   William Davis   21       Mathematics
7        S008      Ava Wilson   20           Physics
8        S009     Liam Taylor   22         Chemistry
9        S010  Isabella Moore   19           Biology
10       S011   Noah Anderson   20  Computer Science

In [35]:
print(type(csv_1))

<class 'pandas.core.frame.DataFrame'>

In [3]:
csv_1.index.array

<NumpyExtensionArray>
[ np.int64(0),  np.int64(1),  np.int64(2),  np.int64(3),  np.int64(4),
  np.int64(5),  np.int64(6),  np.int64(7),  np.int64(8),  np.int64(9),
 np.int64(10), np.int64(11), np.int64(12), np.int64(13), np.int64(14),
 np.int64(15), np.int64(16), np.int64(17), np.int64(18), np.int64(19),
 np.int64(20), np.int64(21), np.int64(22), np.int64(23), np.int64(24),
 np.int64(25), np.int64(26), np.int64(27), np.int64(28), np.int64(29),
 np.int64(30), np.int64(31), np.int64(32), np.int64(33), np.int64(34),
 np.int64(35), np.int64(36), np.int64(37), np.int64(38), np.int64(39),
 np.int64(40), np.int64(41), np.int64(42), np.int64(43), np.int64(44),
 np.int64(45), np.int64(46), np.int64(47), np.int64(48), np.int64(49)]
Length: 50, dtype: int64

In [7]:
csv_1.sort_index(axis=0,ascending=False)
#csv_1.head()

   Student_ID              Name  Age        Department
49       S050      Dylan Cooper   19           Biology
48       S049   Samantha Rivera   22         Chemistry
47       S048     Andrew Murphy   20           Physics
46       S047        Emily Bell   21       Mathematics
45       S046     Joshua Morgan   20  Computer Science
44       S045       Aubrey Cook   19           Biology
43       S044      Matthew Reed   22         Chemistry
42       S043  Elizabeth Rogers   20           Physics
41       S042      Jacob Morris   21       Mathematics
40       S041   Abigail Stewart   20  Computer Science
39       S040     Logan Collins   19           Biology
38       S039     Sofia Edwards   22         Chemistry
37       S038      Elijah Evans   20           Physics
36       S037    Madison Parker   21       Mathematics
35       S036     Owen Campbell   20  Computer Science
34       S035   Hannah Phillips   19           Biology
33       S034     Joseph Turner   22         Chemistry
32       S033  Victoria Roberts   20           Physics
31       S032      Samuel Perez   21       Mathematics
30       S031       Zoey Carter   20  Computer Science
29       S030   Benjamin Nelson   19           Biology
28       S029        Lily Adams   22         Chemistry
27       S028       Jack Wright   20           Physics
26       S027        Aria Scott   21       Mathematics
25       S026        David King   20  Computer Science
24       S025       Chloe Allen   19           Biology
23       S024   Sebastian Young   22         Chemistry
22       S023      Grace Walker   20           Physics
21       S022       Henry Lewis   21       Mathematics
20       S021       Emily Clark   20  Computer Science
19       S020   Daniel Robinson   19           Biology
18       S019   Evelyn Martinez   22         Chemistry
17       S018      Lucas Garcia   20           Physics
16       S017   Harper Thompson   21       Mathematics
15       S016     Amelia Martin   20  Computer Science
14       S015  Alexander Harris   19           Biology
13       S014   Charlotte White   22         Chemistry
12       S013     Ethan Jackson   20           Physics
11       S012        Mia Thomas   21       Mathematics
10       S011     Noah Anderson   20  Computer Science
9        S010    Isabella Moore   19           Biology
8        S009       Liam Taylor   22         Chemistry
7        S008        Ava Wilson   20           Physics
6        S007     William Davis   21       Mathematics
5        S006      Olivia Brown   19  Computer Science
4        S005         James Lee   22           Biology
3        S004      Sophia Patel   20         Chemistry
2        S003      Michael Chen   21           Physics
1        S002      Emma Johnson   19       Mathematics
0        S001        John Smith   20  Computer Science

# REPLACE

In [10]:
import pandas as pd
var=pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv")
var

   Student_ID              Name  Age        Department
0        S001        John Smith   20  Computer Science
1        S002      Emma Johnson   19       Mathematics
2        S003      Michael Chen   21           Physics
3        S004      Sophia Patel   20         Chemistry
4        S005         James Lee   22           Biology
5        S006      Olivia Brown   19  Computer Science
6        S007     William Davis   21       Mathematics
7        S008        Ava Wilson   20           Physics
8        S009       Liam Taylor   22         Chemistry
9        S010    Isabella Moore   19           Biology
10       S011     Noah Anderson   20  Computer Science
11       S012        Mia Thomas   21       Mathematics
12       S013     Ethan Jackson   20           Physics
13       S014   Charlotte White   22         Chemistry
14       S015  Alexander Harris   19           Biology
15       S016     Amelia Martin   20  Computer Science
16       S017   Harper Thompson   21       Mathematics
17       S018      Lucas Garcia   20           Physics
18       S019   Evelyn Martinez   22         Chemistry
19       S020   Daniel Robinson   19           Biology
20       S021       Emily Clark   20  Computer Science
21       S022       Henry Lewis   21       Mathematics
22       S023      Grace Walker   20           Physics
23       S024   Sebastian Young   22         Chemistry
24       S025       Chloe Allen   19           Biology
25       S026        David King   20  Computer Science
26       S027        Aria Scott   21       Mathematics
27       S028       Jack Wright   20           Physics
28       S029        Lily Adams   22         Chemistry
29       S030   Benjamin Nelson   19           Biology
30       S031       Zoey Carter   20  Computer Science
31       S032      Samuel Perez   21       Mathematics
32       S033  Victoria Roberts   20           Physics
33       S034     Joseph Turner   22         Chemistry
34       S035   Hannah Phillips   19           Biology
35       S036     Owen Campbell   20  Computer Science
36       S037    Madison Parker   21       Mathematics
37       S038      Elijah Evans   20           Physics
38       S039     Sofia Edwards   22         Chemistry
39       S040     Logan Collins   19           Biology
40       S041   Abigail Stewart   20  Computer Science
41       S042      Jacob Morris   21       Mathematics
42       S043  Elizabeth Rogers   20           Physics
43       S044      Matthew Reed   22         Chemistry
44       S045       Aubrey Cook   19           Biology
45       S046     Joshua Morgan   20  Computer Science
46       S047        Emily Bell   21       Mathematics
47       S048     Andrew Murphy   20           Physics
48       S049   Samantha Rivera   22         Chemistry
49       S050      Dylan Cooper   19           Biology

In [15]:
var.replace(to_replace=1, value=22)

   Student_ID              Name  Age        Department
0        S001        John Smith   20  Computer Science
1        S002      Emma Johnson   19       Mathematics
2        S003      Michael Chen   21           Physics
3        S004      Sophia Patel   20         Chemistry
4        S005         James Lee   22           Biology
5        S006      Olivia Brown   19  Computer Science
6        S007     William Davis   21       Mathematics
7        S008        Ava Wilson   20           Physics
8        S009       Liam Taylor   22         Chemistry
9        S010    Isabella Moore   19           Biology
10       S011     Noah Anderson   20  Computer Science
11       S012        Mia Thomas   21       Mathematics
12       S013     Ethan Jackson   20           Physics
13       S014   Charlotte White   22         Chemistry
14       S015  Alexander Harris   19           Biology
15       S016     Amelia Martin   20  Computer Science
16       S017   Harper Thompson   21       Mathematics
17       S018      Lucas Garcia   20           Physics
18       S019   Evelyn Martinez   22         Chemistry
19       S020   Daniel Robinson   19           Biology
20       S021       Emily Clark   20  Computer Science
21       S022       Henry Lewis   21       Mathematics
22       S023      Grace Walker   20           Physics
23       S024   Sebastian Young   22         Chemistry
24       S025       Chloe Allen   19           Biology
25       S026        David King   20  Computer Science
26       S027        Aria Scott   21       Mathematics
27       S028       Jack Wright   20           Physics
28       S029        Lily Adams   22         Chemistry
29       S030   Benjamin Nelson   19           Biology
30       S031       Zoey Carter   20  Computer Science
31       S032      Samuel Perez   21       Mathematics
32       S033  Victoria Roberts   20           Physics
33       S034     Joseph Turner   22         Chemistry
34       S035   Hannah Phillips   19           Biology
35       S036     Owen Campbell   20  Computer Science
36       S037    Madison Parker   21       Mathematics
37       S038      Elijah Evans   20           Physics
38       S039     Sofia Edwards   22         Chemistry
39       S040     Logan Collins   19           Biology
40       S041   Abigail Stewart   20  Computer Science
41       S042      Jacob Morris   21       Mathematics
42       S043  Elizabeth Rogers   20           Physics
43       S044      Matthew Reed   22         Chemistry
44       S045       Aubrey Cook   19           Biology
45       S046     Joshua Morgan   20  Computer Science
46       S047        Emily Bell   21       Mathematics
47       S048     Andrew Murphy   20           Physics
48       S049   Samantha Rivera   22         Chemistry
49       S050      Dylan Cooper   19           Biology

In [21]:
var.replace({"Department": "[A-Z]"}, 22, regex=True)    # replace through column wise - {in dictionary}

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_6364\1975528776.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  var.replace({"Department": "[A-Z]"}, 22, regex=True)    # replace through column wise - {in dictionary}

   Student_ID              Name  Age  Department
0        S001        John Smith   20          22
1        S002      Emma Johnson   19          22
2        S003      Michael Chen   21          22
3        S004      Sophia Patel   20          22
4        S005         James Lee   22          22
5        S006      Olivia Brown   19          22
6        S007     William Davis   21          22
7        S008        Ava Wilson   20          22
8        S009       Liam Taylor   22          22
9        S010    Isabella Moore   19          22
10       S011     Noah Anderson   20          22
11       S012        Mia Thomas   21          22
12       S013     Ethan Jackson   20          22
13       S014   Charlotte White   22          22
14       S015  Alexander Harris   19          22
15       S016     Amelia Martin   20          22
16       S017   Harper Thompson   21          22
17       S018      Lucas Garcia   20          22
18       S019   Evelyn Martinez   22          22
19       S020   Daniel Robinson   19          22
20       S021       Emily Clark   20          22
21       S022       Henry Lewis   21          22
22       S023      Grace Walker   20          22
23       S024   Sebastian Young   22          22
24       S025       Chloe Allen   19          22
25       S026        David King   20          22
26       S027        Aria Scott   21          22
27       S028       Jack Wright   20          22
28       S029        Lily Adams   22          22
29       S030   Benjamin Nelson   19          22
30       S031       Zoey Carter   20          22
31       S032      Samuel Perez   21          22
32       S033  Victoria Roberts   20          22
33       S034     Joseph Turner   22          22
34       S035   Hannah Phillips   19          22
35       S036     Owen Campbell   20          22
36       S037    Madison Parker   21          22
37       S038      Elijah Evans   20          22
38       S039     Sofia Edwards   22          22
39       S040     Logan Collins   19          22
40       S041   Abigail Stewart   20          22
41       S042      Jacob Morris   21          22
42       S043  Elizabeth Rogers   20          22
43       S044      Matthew Reed   22          22
44       S045       Aubrey Cook   19          22
45       S046     Joshua Morgan   20          22
46       S047        Emily Bell   21          22
47       S048     Andrew Murphy   20          22
48       S049   Samantha Rivera   22          22
49       S050      Dylan Cooper   19          22

# INTERPOLATE    ---  to fill missing data automatically,in sequence.

In [22]:
import pandas as pd
var=pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv")
var

   Student_ID              Name  Age        Department
0        S001        John Smith   20  Computer Science
1        S002      Emma Johnson   19       Mathematics
2        S003      Michael Chen   21           Physics
3        S004      Sophia Patel   20         Chemistry
4        S005         James Lee   22           Biology
5        S006      Olivia Brown   19  Computer Science
6        S007     William Davis   21       Mathematics
7        S008        Ava Wilson   20           Physics
8        S009       Liam Taylor   22         Chemistry
9        S010    Isabella Moore   19           Biology
10       S011     Noah Anderson   20  Computer Science
11       S012        Mia Thomas   21       Mathematics
12       S013     Ethan Jackson   20           Physics
13       S014   Charlotte White   22         Chemistry
14       S015  Alexander Harris   19           Biology
15       S016     Amelia Martin   20  Computer Science
16       S017   Harper Thompson   21       Mathematics
17       S018      Lucas Garcia   20           Physics
18       S019   Evelyn Martinez   22         Chemistry
19       S020   Daniel Robinson   19           Biology
20       S021       Emily Clark   20  Computer Science
21       S022       Henry Lewis   21       Mathematics
22       S023      Grace Walker   20           Physics
23       S024   Sebastian Young   22         Chemistry
24       S025       Chloe Allen   19           Biology
25       S026        David King   20  Computer Science
26       S027        Aria Scott   21       Mathematics
27       S028       Jack Wright   20           Physics
28       S029        Lily Adams   22         Chemistry
29       S030   Benjamin Nelson   19           Biology
30       S031       Zoey Carter   20  Computer Science
31       S032      Samuel Perez   21       Mathematics
32       S033  Victoria Roberts   20           Physics
33       S034     Joseph Turner   22         Chemistry
34       S035   Hannah Phillips   19           Biology
35       S036     Owen Campbell   20  Computer Science
36       S037    Madison Parker   21       Mathematics
37       S038      Elijah Evans   20           Physics
38       S039     Sofia Edwards   22         Chemistry
39       S040     Logan Collins   19           Biology
40       S041   Abigail Stewart   20  Computer Science
41       S042      Jacob Morris   21       Mathematics
42       S043  Elizabeth Rogers   20           Physics
43       S044      Matthew Reed   22         Chemistry
44       S045       Aubrey Cook   19           Biology
45       S046     Joshua Morgan   20  Computer Science
46       S047        Emily Bell   21       Mathematics
47       S048     Andrew Murphy   20           Physics
48       S049   Samantha Rivera   22         Chemistry
49       S050      Dylan Cooper   19           Biology

In [25]:
var.interpolate()    # WORK ONLY WITH DIGIT

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_6364\2006297061.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  var.interpolate()    # WORK ONLY WITH DIGIT

   Student_ID              Name  Age        Department
0        S001        John Smith   20  Computer Science
1        S002      Emma Johnson   19       Mathematics
2        S003      Michael Chen   21           Physics
3        S004      Sophia Patel   20         Chemistry
4        S005         James Lee   22           Biology
5        S006      Olivia Brown   19  Computer Science
6        S007     William Davis   21       Mathematics
7        S008        Ava Wilson   20           Physics
8        S009       Liam Taylor   22         Chemistry
9        S010    Isabella Moore   19           Biology
10       S011     Noah Anderson   20  Computer Science
11       S012        Mia Thomas   21       Mathematics
12       S013     Ethan Jackson   20           Physics
13       S014   Charlotte White   22         Chemistry
14       S015  Alexander Harris   19           Biology
15       S016     Amelia Martin   20  Computer Science
16       S017   Harper Thompson   21       Mathematics
17       S018      Lucas Garcia   20           Physics
18       S019   Evelyn Martinez   22         Chemistry
19       S020   Daniel Robinson   19           Biology
20       S021       Emily Clark   20  Computer Science
21       S022       Henry Lewis   21       Mathematics
22       S023      Grace Walker   20           Physics
23       S024   Sebastian Young   22         Chemistry
24       S025       Chloe Allen   19           Biology
25       S026        David King   20  Computer Science
26       S027        Aria Scott   21       Mathematics
27       S028       Jack Wright   20           Physics
28       S029        Lily Adams   22         Chemistry
29       S030   Benjamin Nelson   19           Biology
30       S031       Zoey Carter   20  Computer Science
31       S032      Samuel Perez   21       Mathematics
32       S033  Victoria Roberts   20           Physics
33       S034     Joseph Turner   22         Chemistry
34       S035   Hannah Phillips   19           Biology
35       S036     Owen Campbell   20  Computer Science
36       S037    Madison Parker   21       Mathematics
37       S038      Elijah Evans   20           Physics
38       S039     Sofia Edwards   22         Chemistry
39       S040     Logan Collins   19           Biology
40       S041   Abigail Stewart   20  Computer Science
41       S042      Jacob Morris   21       Mathematics
42       S043  Elizabeth Rogers   20           Physics
43       S044      Matthew Reed   22         Chemistry
44       S045       Aubrey Cook   19           Biology
45       S046     Joshua Morgan   20  Computer Science
46       S047        Emily Bell   21       Mathematics
47       S048     Andrew Murphy   20           Physics
48       S049   Samantha Rivera   22         Chemistry
49       S050      Dylan Cooper   19           Biology

#  MERGING AND CONCAT

In [14]:
import pandas as pd 
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"A": [1,2,3,4], "B": [50,80,30,20]})


pd.merge(var1,var2,on="A")

   A  B_x  B_y
0  1   10   50
1  2   20   80
2  3   30   30
3  4   40   20

In [18]:
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"A": [1,2,3,4], "B": [50,80,30,20]})


pd.merge(var1,var2, how="left")

   A   B
0  1  10
1  2  20
2  3  30
3  4  40

In [19]:
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"A": [1,2,3,4], "B": [50,80,30,20]})


pd.merge(var1,var2, how="right")

   A   B
0  1  50
1  2  80
2  3  30
3  4  20

In [20]:
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"A": [1,2,3,4], "B": [50,80,30,20]})


pd.merge(var1,var2, how="inner")

   A   B
0  3  30

In [21]:
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"A": [1,2,3,4], "B": [50,80,30,20]})


pd.merge(var1,var2, how="outer")

   A   B
0  1  10
1  1  50
2  2  20
3  2  80
4  3  30
5  4  20
6  4  40

# CONCAT

In [25]:
p=pd.Series([1,2,3,4])
c=pd.Series([10,20,30,40])

pd.concat([p,c])

0     1
1     2
2     3
3     4
0    10
1    20
2    30
3    40
dtype: int64

In [26]:
d1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
d2=pd.DataFrame({"A": [1,2,3,4], "B": [50,80,30,20]})

pd.concat([d1,d2])

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
0  1  50
1  2  80
2  3  30
3  4  20

In [27]:
pd.concat([d1,d2],axis=1)

   A   B  A   B
0  1  10  1  50
1  2  20  2  80
2  3  30  3  30
3  4  40  4  20

In [28]:
pd.concat([d1,d2],axis=0)

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
0  1  50
1  2  80
2  3  30
3  4  20

#  JOIN AND APPEND

In [32]:
import pandas as pd 
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"C": [1,2,3,4], "D": [50,80,30,20]})

var1.join(var2)

   A   B  C   D
0  1  10  1  50
1  2  20  2  80
2  3  30  3  30
3  4  40  4  20

In [33]:
import pandas as pd 
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"C": [1,2,3,4], "D": [50,80,30,20]})

var2.join(var1, how="left")

   C   D  A   B
0  1  50  1  10
1  2  80  2  20
2  3  30  3  30
3  4  20  4  40

In [34]:
import pandas as pd 
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"C": [1,2,3,4], "D": [50,80,30,20]})

var2.join(var1, how="right")

   C   D  A   B
0  1  50  1  10
1  2  80  2  20
2  3  30  3  30
3  4  20  4  40

# APPEND

In [43]:
import pandas as pd 
var1=pd.DataFrame({"A": [1,2,3,4], "B": [10,20,30,40]})
var2=pd.DataFrame({"C": [1,2,3,4], "D": [50,80,30,20]})

var1.append(var2)

AttributeError: 'DataFrame' object has no attribute 'append'

# GROUP BY

In [2]:
import pandas as pd
var=pd.DataFrame({"name": ["a", "b", "c", "d", "a", "b", "a", "b", "a", "c", "c"],
                   "s_1": [54,52,75,86,85,74,96,98,65,45,96],
                    "s_2": [85,65,65,75,75,85,74,89,98,78,85]})
var

   name  s_1  s_2
0     a   54   85
1     b   52   65
2     c   75   65
3     d   86   75
4     a   85   75
5     b   74   85
6     a   96   74
7     b   98   89
8     a   65   98
9     c   45   78
10    c   96   85

In [3]:
var_new = var.groupby("name")
var_new

In [5]:
for x,y in var_new:
    print(x)
    print(y)
    print()

a
  name  s_1  s_2
0    a   54   85
4    a   85   75
6    a   96   74
8    a   65   98

b
  name  s_1  s_2
1    b   52   65
5    b   74   85
7    b   98   89

c
   name  s_1  s_2
2     c   75   65
9     c   45   78
10    c   96   85

d
  name  s_1  s_2
3    d   86   75

In [7]:
var_new.get_group("a")

  name  s_1  s_2
0    a   54   85
4    a   85   75
6    a   96   74
8    a   65   98

In [8]:
var_new.min()

      s_1  s_2
name
a      54   74
b      52   65
c      45   65
d      86   75

In [9]:
var_new.max()

      s_1  s_2
name
a      96   98
b      98   89
c      96   85
d      86   75

In [10]:
var_new.mean()

            s_1        s_2
name
a     75.000000  83.000000
b     74.666667  79.666667
c     72.000000  76.000000
d     86.000000  75.000000

# RESHAPE - Pivot Table And Melt

# MELT

In [11]:
import pandas as pd
var=pd.DataFrame({"days":[1,2,3,4,5,6],"eng": [15,20,18,20,19,18],"math": [10,14,18,14,20,18]})
var

   days  eng  math
0     1   15    10
1     2   20    14
2     3   18    18
3     4   20    14
4     5   19    20
5     6   18    18

In [12]:
pd.melt(var)

   variable  value
0      days      1
1      days      2
2      days      3
3      days      4
4      days      5
5      days      6
6       eng     15
7       eng     20
8       eng     18
9       eng     20
10      eng     19
11      eng     18
12     math     10
13     math     14
14     math     18
15     math     14
16     math     20
17     math     18

In [13]:
pd.melt(var,id_vars=["days"])

    days variable  value
0      1      eng     15
1      2      eng     20
2      3      eng     18
3      4      eng     20
4      5      eng     19
5      6      eng     18
6      1     math     10
7      2     math     14
8      3     math     18
9      4     math     14
10     5     math     20
11     6     math     18

# Pivot

In [16]:
import pandas as pd
var=pd.DataFrame({"days":[1,2,3,4,5,6],
                  "st_name": ["a","b","c","a","b","c"],
                  "eng": [15,20,18,20,19,18],"math": [10,14,18,14,20,18]})
var

   days st_name  eng  math
0     1       a   15    10
1     2       b   20    14
2     3       c   18    18
3     4       a   20    14
4     5       b   19    20
5     6       c   18    18

In [18]:
var.pivot(index="days",columns="st_name")

          eng              math
st_name     a     b     c     a     b     c
days
1        15.0   NaN   NaN  10.0   NaN   NaN
2         NaN  20.0   NaN   NaN  14.0   NaN
3         NaN   NaN  18.0   NaN   NaN  18.0
4        20.0   NaN   NaN  14.0   NaN   NaN
5         NaN  19.0   NaN   NaN  20.0   NaN
6         NaN   NaN  18.0   NaN   NaN  18.0

In [20]:
var.pivot(index="days",columns="st_name",values="eng")

st_name     a     b     c
days
1        15.0   NaN   NaN
2         NaN  20.0   NaN
3         NaN   NaN  18.0
4        20.0   NaN   NaN
5         NaN  19.0   NaN
6         NaN   NaN  18.0

In [24]:
var.pivot_table(index="st_name",columns="days",aggfunc="mean")

          eng                                math                          \
days        1     2     3     4     5     6     1     2     3     4     5
st_name
a        15.0   NaN   NaN  20.0   NaN   NaN  10.0   NaN   NaN  14.0   NaN
b         NaN  20.0   NaN   NaN  19.0   NaN   NaN  14.0   NaN   NaN  20.0
c         NaN   NaN  18.0   NaN   NaN  18.0   NaN   NaN  18.0   NaN   NaN


days        6
st_name
a         NaN
b         NaN
c        18.0

In [25]:
var.pivot_table(index="st_name",columns="days",aggfunc="sum")

          eng                                math                          \
days        1     2     3     4     5     6     1     2     3     4     5
st_name
a        15.0   NaN   NaN  20.0   NaN   NaN  10.0   NaN   NaN  14.0   NaN
b         NaN  20.0   NaN   NaN  19.0   NaN   NaN  14.0   NaN   NaN  20.0
c         NaN   NaN  18.0   NaN   NaN  18.0   NaN   NaN  18.0   NaN   NaN


days        6
st_name
a         NaN
b         NaN
c        18.0

In [3]:
data={
    "name":["john","alice","bob","emma","liam"],
    "age": [18,19,17,20,18],
    "marks":[85,92,78,65,88]
}
gh=pd.DataFrame(data)
print(gh)

    name  age  marks
0   john   18     85
1  alice   19     92
2    bob   17     78
3   emma   20     65
4   liam   18     88

In [2]:
import  pandas as pd 

data={
    "Name":["Alice","Bob","bob","kapil","emma"],
    "Age":[25,30,30,40,28],
    "salary":[50000,70000,70000,80000,65000],
}
df=pd.DataFrame(data)
print(df)

    Name  Age  salary
0  Alice   25   50000
1    Bob   30   70000
2    bob   30   70000
3  kapil   40   80000
4   emma   28   65000

In [18]:
df.info()                     # TO GET INFORMATION FROM THE DATASET
df.isnull().sum()             # TO FIND OUT THE NULL VALUES FROM THE DATASET
df.duplicated().astype(int)   # TO FIND OUT THE DUPLICATE VALUES FROM THE DATASET
df.drop_duplicates()          # TO DROP_DUPLICATES ROWS FROM THE DATASET


df.head()                     # to find out first 5 rows from the dataset
df.tail()                     # to find out last 5 rows from the dataset
df.describe                   # for the statistical summary of the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

<bound method NDFrame.describe of     Name  Age  salary
0  Alice   25   50000
1    Bob   30   70000
2    bob   30   70000
3  kapil   40   80000
4   emma   28   65000>

# LOC - Labelling and indexing
# ILOC- INDEX BASE LOCATION

In [4]:
import pandas as pd
data=pd.read_csv(r"C:\Users\ADMIN\Documents\student_data.csv")
data

,id,name,age,grade,math_score,english_score,science_score,attendance_percentage,study_hours,extracurricular
0,1,John Smith,15,10,85,78,82,95.5,5,Yes
1,2,Emma Johnson,16,11,90,85,88,92.3,6,No
2,3,Michael Brown,14,9,75,70,72,88.7,4,Yes
3,4,Sophia Davis,15,10,82,80,79,93.1,5,No
4,5,James Wilson,16,11,88,86,90,96.2,7,Yes
...,...,...,...,...,...,...,...,...,...,...
95,96,Piper Ellis,14,9,74,72,71,88.0,3,No
96,97,Kayden Boyd,15,10,81,79,78,92.9,5,Yes
97,98,Aliyah Holmes,16,11,89,87,86,96.0,8,No
98,99,Declan Porter,14,9,73,71,70,87.8,4,Yes
99,100,Sienna Riley,15,10,82,80,79,93.1,6,No

In [15]:
# 1. Using loc, select all columns for the student with id 10.
print(data.loc[9])

id                                    10
name                     Isabella Thomas
age                                   15
grade                                 10
math_score                            84
english_score                         82
science_score                         83
attendance_percentage               92.9
study_hours                            5
extracurricular                       No
Name: 9, dtype: object

In [33]:
# 2. Using iloc, select the first 5 rows and the first 3 columns of the dataset.
print(data.iloc[:5, :3])

   id           name  age
0   1     John Smith   15
1   2   Emma Johnson   16
2   3  Michael Brown   14
3   4   Sophia Davis   15
4   5   James Wilson   16

In [48]:
# 3. Using loc, select the 'name' and 'math_score' for students in grade 11.
print(data.loc[data["grade"]==11,["name", "math_score"]])

                name  math_score
1       Emma Johnson          90
4       James Wilson          88
7       Ava Anderson          91
10        Noah White          89
13   Charlotte Lewis          92
16      Daniel Allen          87
19      Evelyn Scott          90
22        Jack Baker          88
25      Avery Carter          89
28    Elijah Roberts          90
31    Grace Campbell          91
34     Aiden Edwards          89
37       Zoey Morris          90
40     Joseph Morgan          88
43       Aria Cooper          89
46          Luke Cox          90
49      Natalie Wood          91
52       Julian Gray          89
55     Lillian Perry          90
58       Jaxon Kelly          88
61     Arianna Price          89
64       Joshua Ross          90
67      Skylar Ortiz          91
70  Tristan Sullivan          89
73       Maya Hunter          90
76      Aaron Bryant          88
79   Eleanor Russell          89
82     Easton Jordan          90
85   Addison Simmons          91
88        Evan Berry          89
91     Brooklyn Dunn          90
94     Caleb Gardner          88
97     Aliyah Holmes          89

In [ ]:
#4. Using iloc, select the last 10 rows and columns 2 through 5.

In [51]:
print(data.iloc[90:,2:5])

    age  grade  math_score
90   15     10          82
91   16     11          90
92   14      9          75
93   15     10          80
94   16     11          88
95   14      9          74
96   15     10          81
97   16     11          89
98   14      9          73
99   15     10          82

In [57]:
# 5. Using loc, select all columns for students with attendance_percentage greater than 95.
data.loc[data['attendance_percentage'] > 95]

,id,name,age,grade,math_score,english_score,science_score,attendance_percentage,study_hours,extracurricular
0,1,John Smith,15,10,85,78,82,95.5,5,Yes
4,5,James Wilson,16,11,88,86,90,96.2,7,Yes
7,8,Ava Anderson,16,11,91,89,87,97.0,8,No
10,11,Noah White,16,11,89,87,86,95.1,7,Yes
13,14,Charlotte Lewis,16,11,92,90,89,96.5,8,No
16,17,Daniel Allen,16,11,87,85,84,95.8,7,Yes
19,20,Evelyn Scott,16,11,90,88,87,96.3,8,No
22,23,Jack Baker,16,11,88,86,85,95.7,7,Yes
25,26,Avery Carter,16,11,89,87,86,96.1,8,No
28,29,Elijah Roberts,16,11,90,88,87,95.9,7,Yes
31,32,Grace Campbell,16,11,91,89,88,96.4,8,No
34,35,Aiden Edwards,16,11,89,87,86,95.6,7,Yes
37,38,Zoey Morris,16,11,90,88,87,96.2,8,No
40,41,Joseph Morgan,16,11,88,86,85,95.8,7,Yes
43,44,Aria Cooper,16,11,89,87,86,96.0,8,No
46,47,Luke Cox,16,11,90,88,87,95.9,7,Yes
49,50,Natalie Wood,16,11,91,89,88,96.3,8,No
52,53,Julian Gray,16,11,89,87,86,95.7,7,Yes
55,56,Lillian Perry,16,11,90,88,87,96.1,8,No
58,59,Jaxon Kelly,16,11,88,86,85,95.6,7,Yes
61,62,Arianna Price,16,11,89,87,86,96.0,8,No
64,65,Joshua Ross,16,11,90,88,87,95.8,7,Yes
67,68,Skylar Ortiz,16,11,91,89,88,96.2,8,No
70,71,Tristan Sullivan,16,11,89,87,86,95.9,7,Yes
73,74,Maya Hunter,16,11,90,88,87,96.1,8,No
76,77,Aaron Bryant,16,11,88,86,85,95.7,7,Yes
79,80,Eleanor Russell,16,11,89,87,86,96.0,8,No
82,83,Easton Jordan,16,11,90,88,87,95.8,7,Yes
85,86,Addison Simmons,16,11,91,89,88,96.2,8,No
88,89,Evan Berry,16,11,89,87,86,95.9,7,Yes
91,92,Brooklyn Dunn,16,11,90,88,87,96.1,8,No
94,95,Caleb Gardner,16,11,88,86,85,95.7,7,Yes
97,98,Aliyah Holmes,16,11,89,87,86,96.0,8,No

In [12]:
# 6. Using iloc, select every other row from the first 20 rows and columns 0, 3, and 6.
print(data.iloc[0:20:1, [0,3,6]])

    id  grade  science_score
0    1     10             82
1    2     11             88
2    3      9             72
3    4     10             79
4    5     11             90
5    6      9             65
6    7     10             80
7    8     11             87
8    9      9             71
9   10     10             83
10  11     11             86
11  12      9             67
12  13     10             77
13  14     11             89
14  15      9             70
15  16     10             78
16  17     11             84
17  18      9             69
18  19     10             76
19  20     11             87

In [15]:
# 7. Using loc, select 'name', 'age', and 'science_score' for students named 'Emma Johnson' or 'Liam Martinez'.
print(data.loc[data["name"].isin(["Emma Johnson", "Liam Martinez"]), ["name", "age", "science_score"]])

            name  age  science_score
1   Emma Johnson   16             88
8  Liam Martinez   14             71

In [17]:
# 8. Using iloc, select the 10th to 15th rows (inclusive) and the last 3 columns.
print(data.iloc[10:15, -3:])

    attendance_percentage  study_hours extracurricular
10                   95.1            7             Yes
11                   86.8            3              No
12                   93.4            5             Yes
13                   96.5            8              No
14                   88.2            4             Yes

In [18]:
# 9  Using loc, select all columns for students who participate in extracurricular activities (extracurricular = 'Yes').
|

SyntaxError: invalid syntax (1382198581.py, line 2)

In [20]:
# 10  Using iloc, select the first 3 columns for rows 20 to 30.
print(data.iloc[20:30, :3])

    id             name  age
20  21      Lucas Green   14
21  22    Abigail Adams   15
22  23       Jack Baker   16
23  24   Emily Gonzalez   14
24  25  Benjamin Nelson   15
25  26     Avery Carter   16
26  27   Mason Mitchell   14
27  28      Sofia Perez   15
28  29   Elijah Roberts   16
29  30     Chloe Turner   14

In [30]:
#  11 Using loc, select 'name' and 'english_score' for students with math_score above 85.
print(data.loc[data["math_score"]>85,["name","english_score"]])

                name  english_score
1       Emma Johnson             85
4       James Wilson             86
7       Ava Anderson             89
10        Noah White             87
13   Charlotte Lewis             90
16      Daniel Allen             85
19      Evelyn Scott             88
22        Jack Baker             86
25      Avery Carter             87
28    Elijah Roberts             88
31    Grace Campbell             89
34     Aiden Edwards             87
37       Zoey Morris             88
40     Joseph Morgan             86
43       Aria Cooper             87
46          Luke Cox             88
49      Natalie Wood             89
52       Julian Gray             87
55     Lillian Perry             88
58       Jaxon Kelly             86
61     Arianna Price             87
64       Joshua Ross             88
67      Skylar Ortiz             89
70  Tristan Sullivan             87
73       Maya Hunter             88
76      Aaron Bryant             86
79   Eleanor Russell             87
82     Easton Jordan             88
85   Addison Simmons             89
88        Evan Berry             87
91     Brooklyn Dunn             88
94     Caleb Gardner             86
97     Aliyah Holmes             87

In [54]:
# 12  Using iloc, select rows 50 to 60 and columns 'name', 'grade', and 'study_hours' by their index positions.
print(data.iloc[50:61, [1,3,8]])

              name  grade  study_hours
50  Gabriel Fisher      9            4
51  Victoria Stone     10            6
52     Julian Gray     11            7
53    Hazel Hughes      9            3
54       Levi West     10            5
55   Lillian Perry     11            8
56    Grayson Ford      9            4
57    Aubrey Myers     10            6
58     Jaxon Kelly     11            7
59      Ellie Long      9            3
60  Lincoln Foster     10            5

In [47]:
# 13  Using loc, select all columns for students aged 14 who have a science_score below 70.
print(data.loc[data["age"]==14 & data["science_score"]]<70)

Empty DataFrame
Columns: [id, name, age, grade, math_score, english_score, science_score, attendance_percentage, study_hours, extracurricular]
Index: []

In [55]:
# 14 Using iloc, select the 5th column for the first 25 rows.
print(data.iloc[0:25,[ 5]])

    english_score
0              78
1              85
2              70
3              80
4              86
5              68
6              81
7              89
8              73
9              82
10             87
11             69
12             78
13             90
14             72
15             79
16             85
17             71
18             77
19             88
20             70
21             78
22             86
23             72
24             79

# HANDLING MISSING VALUES 
#   (dropna & Fillna)

In [9]:
import pandas as pd
var=pd.read_csv(r"C:\Users\ADMIN\Documents\student_records.csv")
var

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,NaN,78.0,NaN,NaN,NaN,NaN,NaN
2,3,Charlie,21.0,NaN,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,NaN,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,NaN,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,NaN,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,NaN,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [14]:
var.dropna()        #  ROW WISE
#var.dropna(axis=1)  # COLUMN WISE

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
5,6,Frank,20.0,70.0,C,88.0,Chemistry,3.0
7,8,Hannah,23.0,95.0,A,97.5,Mathematics,4.0
10,11,Kevin,20.0,75.0,C,87.0,Chemistry,2.9
11,12,Laura,22.0,90.0,A,94.0,Computer Science,3.8
...,...,...,...,...,...,...,...,...
191,192,Will,23.0,88.0,C,89.5,Computer Science,3.3
193,194,Xena,22.0,85.0,A,90.5,Physics,3.7
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [17]:
var.dropna(how="any")         # to drop particular missing row

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
5,6,Frank,20.0,70.0,C,88.0,Chemistry,3.0
7,8,Hannah,23.0,95.0,A,97.5,Mathematics,4.0
10,11,Kevin,20.0,75.0,C,87.0,Chemistry,2.9
11,12,Laura,22.0,90.0,A,94.0,Computer Science,3.8
...,...,...,...,...,...,...,...,...
191,192,Will,23.0,88.0,C,89.5,Computer Science,3.3
193,194,Xena,22.0,85.0,A,90.5,Physics,3.7
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [18]:
var.dropna()

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
5,6,Frank,20.0,70.0,C,88.0,Chemistry,3.0
7,8,Hannah,23.0,95.0,A,97.5,Mathematics,4.0
10,11,Kevin,20.0,75.0,C,87.0,Chemistry,2.9
11,12,Laura,22.0,90.0,A,94.0,Computer Science,3.8
...,...,...,...,...,...,...,...,...
191,192,Will,23.0,88.0,C,89.5,Computer Science,3.3
193,194,Xena,22.0,85.0,A,90.5,Physics,3.7
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [19]:
var.dropna(subset=["name"])     # to drop particular missing column  use-subset

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
2,3,Charlie,21.0,NaN,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,NaN,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,NaN,2.8
5,6,Frank,20.0,70.0,C,88.0,Chemistry,3.0
...,...,...,...,...,...,...,...,...
194,195,Yara,20.0,91.0,C,NaN,Biology,3.4
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,NaN,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [21]:
var.dropna(inplace=True)
var

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
5,6,Frank,20.0,70.0,C,88.0,Chemistry,3.0
7,8,Hannah,23.0,95.0,A,97.5,Mathematics,4.0
10,11,Kevin,20.0,75.0,C,87.0,Chemistry,2.9
11,12,Laura,22.0,90.0,A,94.0,Computer Science,3.8
...,...,...,...,...,...,...,...,...
191,192,Will,23.0,88.0,C,89.5,Computer Science,3.3
193,194,Xena,22.0,85.0,A,90.5,Physics,3.7
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [23]:
var.dropna(thresh=2)       #  To drop null values like 1,2,3..particularly.

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
5,6,Frank,20.0,70.0,C,88.0,Chemistry,3.0
7,8,Hannah,23.0,95.0,A,97.5,Mathematics,4.0
10,11,Kevin,20.0,75.0,C,87.0,Chemistry,2.9
11,12,Laura,22.0,90.0,A,94.0,Computer Science,3.8
...,...,...,...,...,...,...,...,...
191,192,Will,23.0,88.0,C,89.5,Computer Science,3.3
193,194,Xena,22.0,85.0,A,90.5,Physics,3.7
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

# Fillna

In [24]:
var.fillna("happy")

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
5,6,Frank,20.0,70.0,C,88.0,Chemistry,3.0
7,8,Hannah,23.0,95.0,A,97.5,Mathematics,4.0
10,11,Kevin,20.0,75.0,C,87.0,Chemistry,2.9
11,12,Laura,22.0,90.0,A,94.0,Computer Science,3.8
...,...,...,...,...,...,...,...,...
191,192,Will,23.0,88.0,C,89.5,Computer Science,3.3
193,194,Xena,22.0,85.0,A,90.5,Physics,3.7
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [25]:
import pandas as pd
var=pd.read_csv(r"C:\Users\ADMIN\Documents\student_records.csv")
var

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,NaN,78.0,NaN,NaN,NaN,NaN,NaN
2,3,Charlie,21.0,NaN,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,NaN,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,NaN,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,NaN,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,NaN,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [26]:
var.fillna("happy")

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,happy,78.0,happy,happy,happy,happy,happy
2,3,Charlie,21.0,happy,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,happy,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,happy,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,happy,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,happy,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [29]:
var.fillna({"name": "happy", "department": "C"})

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,happy,78.0,NaN,NaN,NaN,C,NaN
2,3,Charlie,21.0,NaN,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,NaN,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,C,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,NaN,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,happy,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [32]:
var.fillna(method="ffill")        # FORWARD FILLING

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_8396\1356446924.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  var.fillna(method="ffill")        # FORWARD FILLING

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,Alice,78.0,85.0,A,95.5,Computer Science,3.8
2,3,Charlie,21.0,85.0,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,92.5,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,Biology,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,78.0,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,Beth,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [35]:
var.fillna(method="bfill")     #  BACKWARD FILLING

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_8396\2074443170.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  var.fillna(method="bfill")     #  BACKWARD FILLING

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,Charlie,78.0,92.0,B,92.5,Physics,3.5
2,3,Charlie,21.0,92.0,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,85.5,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,Chemistry,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,90.0,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,Carl,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [36]:
var.fillna(method="Ffill",axis=0)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_8396\649979080.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  var.fillna(method="Ffill",axis=0)

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,Alice,78.0,85.0,A,95.5,Computer Science,3.8
2,3,Charlie,21.0,85.0,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,92.5,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,Biology,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,78.0,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,Beth,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [37]:
var.fillna(method="Ffill",axis=1)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_8396\3224578241.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  var.fillna(method="Ffill",axis=1)
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_8396\3224578241.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  var.fillna(method="Ffill",axis=1)

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2.0,2.0,78.0,78.0,78.0,78.0,78.0,78.0
2,3,Charlie,21.0,21.0,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,A,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,85.5,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,21.0,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,199,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [40]:
var.fillna(10,inplace=True)
var                                   # get replacing file in orignal file

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,10,78.0,10.0,10,10.0,10,10.0
2,3,Charlie,21.0,10.0,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,10.0,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,10,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,10.0,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,10,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [42]:
var.fillna("happy",limit=2)

,student_id,name,age,test_score,grade,attendance_percentage,department,gpa
0,1,Alice,20.0,85.0,A,95.5,Computer Science,3.8
1,2,10,78.0,10.0,10,10.0,10,10.0
2,3,Charlie,21.0,10.0,B,92.5,Physics,3.5
3,4,David,19.0,92.0,A,10.0,Biology,3.9
4,5,Emma,22.0,65.0,C,85.5,10,2.8
...,...,...,...,...,...,...,...,...
195,196,Zoe,19.0,78.0,B,95.0,Chemistry,3.0
196,197,Adam,21.0,10.0,A,92.5,Computer Science,3.8
197,198,Beth,22.0,90.0,C,90.0,Mathematics,3.2
198,199,10,23.0,83.0,B,94.5,Physics,3.6
199,200,Carl,20.0,95.0,A,89.5,Biology,3.9

In [16]:
data['payment_method']=data['payment_method'].fillna('function')
data['payment_method'].isnull().sum()

np.int64(0)

In [68]:
# want to extract data customer age>30 and salary is > 50000
data['age ']=data['age'].fillna(data['age'].mean())
data['age'].isnull().sum()

np.int64(10)

In [30]:
# whose payment method is credit card and subscription plan is premium
p = data[(data['payment_method'] == 'Credit Card') & (data['subscription_plan'] == 'Premium')]

# PANDAS AGGREGATE FUNCTIONS (COUNT,MIN,MAX)

In [3]:
import pandas as pd
import numpy as np

# Create the dataset
data = {
    'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'East'],
    'Product': ['Apple', 'Banana', 'Apple', 'Orange', 'Banana', 'Apple', 'Orange', 'Banana', 'Apple', 'Banana'],
    'Sales': [100, 400, 200, 450, 300, 150, 350, 500, 250, 300]
}
df = pd.DataFrame(data)
df.head()

# 1. Applying each aggregation function one by one on 'Sales'
print("1. Single Aggregation Functions on Sales:")
# Sum
print("\nSum of Sales by Region:")
print(df.groupby('Region')['Sales'].sum())

# Mean
print("\nMean of Sales by Region:")
print(df.groupby('Region')['Sales'].mean())
# Count
print("\nCount of Sales by Region:")
print(df.groupby('Region')['Sales'].count())

# Min
print("\nMinimum Sales by Region:")
print(df.groupby('Region')['Sales'].min())

# Max
print("\nMaximum Sales by Region:")
print(df.groupby('Region')['Sales'].max())

# Standard Deviation
print("\nStandard Deviation of Sales by Region:")
print(df.groupby('Region')['Sales'].std())

# Variance
print("\nVariance of Sales by Region:")
print(df.groupby('Region')['Sales'].var())

1. Single Aggregation Functions on Sales:

Sum of Sales by Region:
Region
East     850
North    650
South    550
West     950
Name: Sales, dtype: int64

Mean of Sales by Region:
Region
East     283.333333
North    216.666667
South    275.000000
West     475.000000
Name: Sales, dtype: float64

Count of Sales by Region:
Region
East     3
North    3
South    2
West     2
Name: Sales, dtype: int64

Minimum Sales by Region:
Region
East     200
North    100
South    150
West     450
Name: Sales, dtype: int64

Maximum Sales by Region:
Region
East     350
North    300
South    400
West     500
Name: Sales, dtype: int64

Standard Deviation of Sales by Region:
Region
East      76.376262
North    104.083300
South    176.776695
West      35.355339
Name: Sales, dtype: float64

Variance of Sales by Region:
Region
East      5833.333333
North    10833.333333
South    31250.000000
West      1250.000000
Name: Sales, dtype: float64

In [4]:
import pandas as pd

# Create the sample dataset
data = {
    'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'East'],
    'Product': ['Apple', 'Banana', 'Apple', 'Orange', 'Banana', 'Apple', 'Orange', 'Banana', 'Apple', 'Banana'],
    'Sales': [100, 400, 200, 450, 300, 150, 350, 500, 250, 420],
    'Units_Sold': [5, 20, 10, 15, 12, 8, 14, 25, 10, 18]
}
df = pd.DataFrame(data)
df.head()

  Region Product  Sales  Units_Sold
0  North   Apple    100           5
1  South  Banana    400          20
2   East   Apple    200          10
3   West  Orange    450          15
4  North  Banana    300          12

In [5]:
# Display the dataset
print("Sample Dataset:")
print(df)

# Example 1: Basic Aggregation on Multiple Columns
print("\nExample 1: Basic Aggregation on Multiple Columns")
result1 = df.groupby('Region').agg({
    'Sales': 'sum',           # Total sales per region
    'Units_Sold': 'mean',     # Average units sold per region
    'Product': 'nunique'      # Count of unique products per region
})
print(result1)

# Example 4: Grouping by Multiple Columns
print("\nExample 4: Aggregation by Region and Product")
result4 = df.groupby(['Region', 'Product']).agg({
    'Sales': 'sum',           # Total sales per region and product
    'Units_Sold': 'sum'       # Total units sold per region and product
})
print(result4)

Sample Dataset:
  Region Product  Sales  Units_Sold
0  North   Apple    100           5
1  South  Banana    400          20
2   East   Apple    200          10
3   West  Orange    450          15
4  North  Banana    300          12
5  South   Apple    150           8
6   East  Orange    350          14
7   West  Banana    500          25
8  North   Apple    250          10
9   East  Banana    420          18

Example 1: Basic Aggregation on Multiple Columns
        Sales  Units_Sold  Product
Region
East      970        14.0        3
North     650         9.0        2
South     550        14.0        2
West      950        20.0        2

Example 4: Aggregation by Region and Product
                Sales  Units_Sold
Region Product
East   Apple      200          10
       Banana     420          18
       Orange     350          14
North  Apple      350          15
       Banana     300          12
South  Apple      150           8
       Banana     400          20
West   Banana     500          25
       Orange     450          15